alibaba/AliOS-Things/platform/mcu/bk7231s/beken/driver/common/reg/reg_mdm_stat.h
// field definitions
/// STOSLOPESTAT field mask
#define MDM_STOSLOPESTAT_MASK     ((uint32_t)0x3FFFF000)
/// STOSLOPESTAT field LSB position
#define MDM_STOSLOPESTAT_LSB      12
/// STOSLOPESTAT field width
#define MDM_STOSLOPESTAT_WIDTH    ((uint32_t)0x00000012)
/// TDSYNCHOFFSTAT field mask
#define MDM_TDSYNCHOFFSTAT_MASK   ((uint32_t)0x0000003F)
/// TDSYNCHOFFSTAT field LSB position
#define MDM_TDSYNCHOFFSTAT_LSB    0
/// TDSYNCHOFFSTAT field width
#define MDM_TDSYNCHOFFSTAT_WIDTH  ((uint32_t)0x00000006)

/// STOSLOPESTAT field reset value
#define MDM_STOSLOPESTAT_RST      0x0
/// TDSYNCHOFFSTAT field reset value
#define MDM_TDSYNCHOFFSTAT_RST    0x0

/**
 * @brief Unpacks FDTOFFSETSTAT0's fields from current value of the FDTOFFSETSTAT0 register.
 *
 * Reads the FDTOFFSETSTAT0 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] stoslopestat - Will be populated with the current value of this field from the register.
 * @param[out] tdsynchoffstat - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_fdtoffsetstat0_unpack(uint32_t *stoslopestat, uint8_t *tdsynchoffstat)
{
    uint32_t localVal = REG_PL_RD(MDM_FDTOFFSETSTAT0_ADDR);

    *stoslopestat = (localVal & ((uint32_t)0x3FFFF000)) >> 12;
    *tdsynchoffstat = (localVal & ((uint32_t)0x0000003F)) >> 0;
}

/**
 * @brief Returns the current value of the STOSLOPESTAT field in the FDTOFFSETSTAT0 register.
 *
 * The FDTOFFSETSTAT0 register will be read and the STOSLOPESTAT field's value will be returned.
 *
 * @return The current value of the STOSLOPESTAT field in the FDTOFFSETSTAT0 register.
 */
__INLINE uint32_t mdm_stoslopestat_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_FDTOFFSETSTAT0_ADDR);
    return ((localVal & ((uint32_t)0x3FFFF000)) >> 12);
}

/**
 * @brief Returns the current value of the TDSYNCHOFFSTAT field in the FDTOFFSETSTAT0 register.
 *
 * The FDTOFFSETSTAT0 register will be read and the TDSYNCHOFFSTAT field's value will be returned.
 *
 * @return The current value of the TDSYNCHOFFSTAT field in the FDTOFFSETSTAT0 register.
 */
__INLINE uint8_t mdm_tdsynchoffstat_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_FDTOFFSETSTAT0_ADDR);
    return ((localVal & ((uint32_t)0x0000003F)) >> 0);
}

/// @}

/**
 * @name FDTOFFSETSTAT1 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  17:00         CPESLOPESTAT   0x0
 * </pre>
 *
 * @{
 */

/// Address of the FDTOFFSETSTAT1 register
#define MDM_FDTOFFSETSTAT1_ADDR   0x01000010
/// Offset of the FDTOFFSETSTAT1 register from the base address
#define MDM_FDTOFFSETSTAT1_OFFSET 0x00000010
/// Index of the FDTOFFSETSTAT1 register
#define MDM_FDTOFFSETSTAT1_INDEX  0x00000004
/// Reset value of the FDTOFFSETSTAT1 register
#define MDM_FDTOFFSETSTAT1_RESET  0x00000000

/**
 * @brief Returns the current value of the FDTOFFSETSTAT1 register.
 * The FDTOFFSETSTAT1 register will be read and its value returned.
 * @return The current value of the FDTOFFSETSTAT1 register.
 */
__INLINE uint32_t mdm_fdtoffsetstat1_get(void)
{
    return REG_PL_RD(MDM_FDTOFFSETSTAT1_ADDR);
}

// field definitions
/// CPESLOPESTAT field mask
#define MDM_CPESLOPESTAT_MASK   ((uint32_t)0x0003FFFF)
/// CPESLOPESTAT field LSB position
#define MDM_CPESLOPESTAT_LSB    0
/// CPESLOPESTAT field width
#define MDM_CPESLOPESTAT_WIDTH  ((uint32_t)0x00000012)

/// CPESLOPESTAT field reset value
#define MDM_CPESLOPESTAT_RST    0x0

/**
 * @brief Returns the current value of the CPESLOPESTAT field in the FDTOFFSETSTAT1 register.
 *
 * The FDTOFFSETSTAT1 register will be read and the CPESLOPESTAT field's value will be returned.
 *
 * @return The current value of the CPESLOPESTAT field in the FDTOFFSETSTAT1 register.
 */
__INLINE uint32_t mdm_cpeslopestat_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_FDTOFFSETSTAT1_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x0003FFFF)) == 0);
    return (localVal >> 0);
}

/// @}

/**
 * @name RXFSMSTAT0 register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  31:16           FDSYMBOLNR   0x0
 *  15:00           TDSYMBOLNR   0x0
 * </pre>
 *
 * @{
 */

/// Address of the RXFSMSTAT0 register
#define MDM_RXFSMSTAT0_ADDR   0x01000014
/// Offset of the RXFSMSTAT0 register from the base address
#define MDM_RXFSMSTAT0_OFFSET 0x00000014
/// Index of the RXFSMSTAT0 register
#define MDM_RXFSMSTAT0_INDEX  0x00000005
/// Reset value of the RXFSMSTAT0 register
#define MDM_RXFSMSTAT0_RESET  0x00000000

/**
 * @brief Returns the current value of the RXFSMSTAT0 register.
 * The RXFSMSTAT0 register will be read and its value returned.
 * @return The current value of the RXFSMSTAT0 register.
 */
__INLINE uint32_t mdm_rxfsmstat0_get(void)
{
    return REG_PL_RD(MDM_RXFSMSTAT0_ADDR);
}

// field definitions
/// FDSYMBOLNR field mask
#define MDM_FDSYMBOLNR_MASK   ((uint32_t)0xFFFF0000)
/// FDSYMBOLNR field LSB position
#define MDM_FDSYMBOLNR_LSB    16
/// FDSYMBOLNR field width
#define MDM_FDSYMBOLNR_WIDTH  ((uint32_t)0x00000010)
/// TDSYMBOLNR field mask
#define MDM_TDSYMBOLNR_MASK   ((uint32_t)0x0000FFFF)
/// TDSYMBOLNR field LSB position
#define MDM_TDSYMBOLNR_LSB    0
/// TDSYMBOLNR field width
#define MDM_TDSYMBOLNR_WIDTH  ((uint32_t)0x00000010)

/// FDSYMBOLNR field reset value
#define MDM_FDSYMBOLNR_RST    0x0
/// TDSYMBOLNR field reset value
#define MDM_TDSYMBOLNR_RST    0x0

/**
 * @brief Unpacks RXFSMSTAT0's fields from current value of the RXFSMSTAT0 register.
 *
 * Reads the RXFSMSTAT0 register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] fdsymbolnr - Will be populated with the current value of this field from the register.
 * @param[out] tdsymbolnr - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_rxfsmstat0_unpack(uint16_t *fdsymbolnr, uint16_t *tdsymbolnr)
{
    uint32_t localVal = REG_PL_RD(MDM_RXFSMSTAT0_ADDR);

