alibaba/AliOS-Things/platform/mcu/bk7231s/beken/driver/common/reg/reg_mdm_stat.h
// field definitions
/// AGCGAIN3 field mask
#define MDM_AGCGAIN3_MASK   ((uint32_t)0x7F000000)
/// AGCGAIN3 field LSB position
#define MDM_AGCGAIN3_LSB    24
/// AGCGAIN3 field width
#define MDM_AGCGAIN3_WIDTH  ((uint32_t)0x00000007)
/// AGCGAIN2 field mask
#define MDM_AGCGAIN2_MASK   ((uint32_t)0x007F0000)
/// AGCGAIN2 field LSB position
#define MDM_AGCGAIN2_LSB    16
/// AGCGAIN2 field width
#define MDM_AGCGAIN2_WIDTH  ((uint32_t)0x00000007)
/// AGCGAIN1 field mask
#define MDM_AGCGAIN1_MASK   ((uint32_t)0x00007F00)
/// AGCGAIN1 field LSB position
#define MDM_AGCGAIN1_LSB    8
/// AGCGAIN1 field width
#define MDM_AGCGAIN1_WIDTH  ((uint32_t)0x00000007)
/// AGCGAIN0 field mask
#define MDM_AGCGAIN0_MASK   ((uint32_t)0x0000007F)
/// AGCGAIN0 field LSB position
#define MDM_AGCGAIN0_LSB    0
/// AGCGAIN0 field width
#define MDM_AGCGAIN0_WIDTH  ((uint32_t)0x00000007)

/// AGCGAIN3 field reset value
#define MDM_AGCGAIN3_RST    0x0
/// AGCGAIN2 field reset value
#define MDM_AGCGAIN2_RST    0x0
/// AGCGAIN1 field reset value
#define MDM_AGCGAIN1_RST    0x0
/// AGCGAIN0 field reset value
#define MDM_AGCGAIN0_RST    0x0

/**
 * @brief Unpacks AGCGAINSTAT's fields from current value of the AGCGAINSTAT register.
 *
 * Reads the AGCGAINSTAT register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] agcgain3 - Will be populated with the current value of this field from the register.
 * @param[out] agcgain2 - Will be populated with the current value of this field from the register.
 * @param[out] agcgain1 - Will be populated with the current value of this field from the register.
 * @param[out] agcgain0 - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_agcgainstat_unpack(uint8_t *agcgain3, uint8_t *agcgain2, uint8_t *agcgain1, uint8_t *agcgain0)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCGAINSTAT_ADDR);

    *agcgain3 = (localVal & ((uint32_t)0x7F000000)) >> 24;
    *agcgain2 = (localVal & ((uint32_t)0x007F0000)) >> 16;
    *agcgain1 = (localVal & ((uint32_t)0x00007F00)) >> 8;
    *agcgain0 = (localVal & ((uint32_t)0x0000007F)) >> 0;
}

/**
 * @brief Returns the current value of the AGCGAIN3 field in the AGCGAINSTAT register.
 *
 * The AGCGAINSTAT register will be read and the AGCGAIN3 field's value will be returned.
 *
 * @return The current value of the AGCGAIN3 field in the AGCGAINSTAT register.
 */
__INLINE uint8_t mdm_agcgain3_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCGAINSTAT_ADDR);
    return ((localVal & ((uint32_t)0x7F000000)) >> 24);
}

/**
 * @brief Returns the current value of the AGCGAIN2 field in the AGCGAINSTAT register.
 *
 * The AGCGAINSTAT register will be read and the AGCGAIN2 field's value will be returned.
 *
 * @return The current value of the AGCGAIN2 field in the AGCGAINSTAT register.
 */
__INLINE uint8_t mdm_agcgain2_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCGAINSTAT_ADDR);
    return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

/**
 * @brief Returns the current value of the AGCGAIN1 field in the AGCGAINSTAT register.
 *
 * The AGCGAINSTAT register will be read and the AGCGAIN1 field's value will be returned.
 *
 * @return The current value of the AGCGAIN1 field in the AGCGAINSTAT register.
 */
__INLINE uint8_t mdm_agcgain1_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCGAINSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00007F00)) >> 8);
}

/**
 * @brief Returns the current value of the AGCGAIN0 field in the AGCGAINSTAT register.
 *
 * The AGCGAINSTAT register will be read and the AGCGAIN0 field's value will be returned.
 *
 * @return The current value of the AGCGAIN0 field in the AGCGAINSTAT register.
 */
__INLINE uint8_t mdm_agcgain0_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCGAINSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

/// @}

/**
 * @name AGCADCPOWSTAT register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *  30:24           ADCPOWDBV3   0x0
 *  22:16           ADCPOWDBV2   0x0
 *  14:08           ADCPOWDBV1   0x0
 *  06:00           ADCPOWDBV0   0x0
 * </pre>
 *
 * @{
 */

/// Address of the AGCADCPOWSTAT register
#define MDM_AGCADCPOWSTAT_ADDR   0x01000064
/// Offset of the AGCADCPOWSTAT register from the base address
#define MDM_AGCADCPOWSTAT_OFFSET 0x00000064
/// Index of the AGCADCPOWSTAT register
#define MDM_AGCADCPOWSTAT_INDEX  0x00000019
/// Reset value of the AGCADCPOWSTAT register
#define MDM_AGCADCPOWSTAT_RESET  0x00000000

/**
 * @brief Returns the current value of the AGCADCPOWSTAT register.
 * The AGCADCPOWSTAT register will be read and its value returned.
 * @return The current value of the AGCADCPOWSTAT register.
 */
__INLINE uint32_t mdm_agcadcpowstat_get(void)
{
    return REG_PL_RD(MDM_AGCADCPOWSTAT_ADDR);
}

// field definitions
/// ADCPOWDBV3 field mask
#define MDM_ADCPOWDBV3_MASK   ((uint32_t)0x7F000000)
/// ADCPOWDBV3 field LSB position
#define MDM_ADCPOWDBV3_LSB    24
/// ADCPOWDBV3 field width
#define MDM_ADCPOWDBV3_WIDTH  ((uint32_t)0x00000007)
/// ADCPOWDBV2 field mask
#define MDM_ADCPOWDBV2_MASK   ((uint32_t)0x007F0000)
/// ADCPOWDBV2 field LSB position
#define MDM_ADCPOWDBV2_LSB    16
/// ADCPOWDBV2 field width
#define MDM_ADCPOWDBV2_WIDTH  ((uint32_t)0x00000007)
/// ADCPOWDBV1 field mask
#define MDM_ADCPOWDBV1_MASK   ((uint32_t)0x00007F00)
/// ADCPOWDBV1 field LSB position
#define MDM_ADCPOWDBV1_LSB    8
/// ADCPOWDBV1 field width
#define MDM_ADCPOWDBV1_WIDTH  ((uint32_t)0x00000007)
/// ADCPOWDBV0 field mask
#define MDM_ADCPOWDBV0_MASK   ((uint32_t)0x0000007F)
/// ADCPOWDBV0 field LSB position
#define MDM_ADCPOWDBV0_LSB    0
/// ADCPOWDBV0 field width
#define MDM_ADCPOWDBV0_WIDTH  ((uint32_t)0x00000007)

/// ADCPOWDBV3 field reset value
#define MDM_ADCPOWDBV3_RST    0x0
/// ADCPOWDBV2 field reset value
#define MDM_ADCPOWDBV2_RST    0x0
/// ADCPOWDBV1 field reset value
#define MDM_ADCPOWDBV1_RST    0x0
/// ADCPOWDBV0 field reset value
#define MDM_ADCPOWDBV0_RST    0x0

/**
 * @brief Unpacks AGCADCPOWSTAT's fields from current value of the AGCADCPOWSTAT register.
 *
 * Reads the AGCADCPOWSTAT register and populates all the _field variables with the corresponding
 * values from the register.
 *
 * @param[out] adcpowdbv3 - Will be populated with the current value of this field from the register.
 * @param[out] adcpowdbv2 - Will be populated with the current value of this field from the register.
 * @param[out] adcpowdbv1 - Will be populated with the current value of this field from the register.
 * @param[out] adcpowdbv0 - Will be populated with the current value of this field from the register.
 */
__INLINE void mdm_agcadcpowstat_unpack(uint8_t *adcpowdbv3, uint8_t *adcpowdbv2, uint8_t *adcpowdbv1, uint8_t *adcpowdbv0)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCADCPOWSTAT_ADDR);

    *adcpowdbv3 = (localVal & ((uint32_t)0x7F000000)) >> 24;
    *adcpowdbv2 = (localVal & ((uint32_t)0x007F0000)) >> 16;
    *adcpowdbv1 = (localVal & ((uint32_t)0x00007F00)) >> 8;
    *adcpowdbv0 = (localVal & ((uint32_t)0x0000007F)) >> 0;
}

/**
 * @brief Returns the current value of the ADCPOWDBV3 field in the AGCADCPOWSTAT register.
 *
 * The AGCADCPOWSTAT register will be read and the ADCPOWDBV3 field's value will be returned.
 *
 * @return The current value of the ADCPOWDBV3 field in the AGCADCPOWSTAT register.
 */
__INLINE uint8_t mdm_adcpowdbv3_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCADCPOWSTAT_ADDR);
    return ((localVal & ((uint32_t)0x7F000000)) >> 24);
}

/**
 * @brief Returns the current value of the ADCPOWDBV2 field in the AGCADCPOWSTAT register.
 *
 * The AGCADCPOWSTAT register will be read and the ADCPOWDBV2 field's value will be returned.
 *
 * @return The current value of the ADCPOWDBV2 field in the AGCADCPOWSTAT register.
 */
__INLINE uint8_t mdm_adcpowdbv2_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCADCPOWSTAT_ADDR);
    return ((localVal & ((uint32_t)0x007F0000)) >> 16);
}

/**
 * @brief Returns the current value of the ADCPOWDBV1 field in the AGCADCPOWSTAT register.
 *
 * The AGCADCPOWSTAT register will be read and the ADCPOWDBV1 field's value will be returned.
 *
 * @return The current value of the ADCPOWDBV1 field in the AGCADCPOWSTAT register.
 */
__INLINE uint8_t mdm_adcpowdbv1_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCADCPOWSTAT_ADDR);
    return ((localVal & ((uint32_t)0x00007F00)) >> 8);
}

/**
 * @brief Returns the current value of the ADCPOWDBV0 field in the AGCADCPOWSTAT register.
 *
 * The AGCADCPOWSTAT register will be read and the ADCPOWDBV0 field's value will be returned.
 *
 * @return The current value of the ADCPOWDBV0 field in the AGCADCPOWSTAT register.
 */
__INLINE uint8_t mdm_adcpowdbv0_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_AGCADCPOWSTAT_ADDR);
    return ((localVal & ((uint32_t)0x0000007F)) >> 0);
}

/// @}

/**
 * @name RADARFIFOSTAT register definitions
 * <pre>
 *   Bits           Field Name   Reset Value
 *  -----   ------------------   -----------
 *     00         RADFIFOEMPTY   0
 * </pre>
 *
 * @{
 */

/// Address of the RADARFIFOSTAT register
#define MDM_RADARFIFOSTAT_ADDR   0x01000068
/// Offset of the RADARFIFOSTAT register from the base address
#define MDM_RADARFIFOSTAT_OFFSET 0x00000068
/// Index of the RADARFIFOSTAT register
#define MDM_RADARFIFOSTAT_INDEX  0x0000001A
/// Reset value of the RADARFIFOSTAT register
#define MDM_RADARFIFOSTAT_RESET  0x00000000

/**
 * @brief Returns the current value of the RADARFIFOSTAT register.
 * The RADARFIFOSTAT register will be read and its value returned.
 * @return The current value of the RADARFIFOSTAT register.
 */
__INLINE uint32_t mdm_radarfifostat_get(void)
{
    return REG_PL_RD(MDM_RADARFIFOSTAT_ADDR);
}

// field definitions
/// RADFIFOEMPTY field bit
#define MDM_RADFIFOEMPTY_BIT    ((uint32_t)0x00000001)
/// RADFIFOEMPTY field position
#define MDM_RADFIFOEMPTY_POS    0

/// RADFIFOEMPTY field reset value
#define MDM_RADFIFOEMPTY_RST    0x0

/**
 * @brief Returns the current value of the RADFIFOEMPTY field in the RADARFIFOSTAT register.
 *
 * The RADARFIFOSTAT register will be read and the RADFIFOEMPTY field's value will be returned.
 *
 * @return The current value of the RADFIFOEMPTY field in the RADARFIFOSTAT register.
 */
__INLINE uint8_t mdm_radfifoempty_getf(void)
{
    uint32_t localVal = REG_PL_RD(MDM_RADARFIFOSTAT_ADDR);
    ASSERT_ERR((localVal & ~((uint32_t)0x00000001)) == 0);
    return (localVal >> 0);
}

/// @}


#endif // _REG_MDM_STAT_H_

/// @}

